
## Plan Result




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 23 to add, 5 to change, 4 to destroy.</code></pre>

* Create
  * azurerm_key_vault_secret.palo_password
  * azurerm_linux_virtual_machine.palo
  * azurerm_network_interface.palo[&#34;mgmt&#34;]
  * azurerm_network_interface.palo[&#34;trust&#34;]
  * azurerm_network_interface.palo[&#34;untrust&#34;]
  * azurerm_network_security_group.palo_nsg[&#34;mgmt&#34;]
  * azurerm_network_security_group.palo_nsg[&#34;trust&#34;]
  * azurerm_network_security_group.palo_nsg[&#34;untrust&#34;]
  * azurerm_network_security_rule.deny_inbound[&#34;mgmt&#34;]
  * azurerm_public_ip.palo_pip[&#34;mgmt&#34;]
  * azurerm_storage_blob.migration-st
  * azurerm_subnet.palo_subnet[&#34;mgmt&#34;]
  * azurerm_subnet.palo_subnet[&#34;trust&#34;]
  * azurerm_subnet.palo_subnet[&#34;untrust&#34;]
  * azurerm_subnet_network_security_group_association.name[&#34;mgmt&#34;]
  * azurerm_subnet_network_security_group_association.name[&#34;trust&#34;]
  * azurerm_subnet_network_security_group_association.name[&#34;untrust&#34;]
  * random_password.palo_password
  * module.sa-migration.azurerm_storage_container.container[&#34;darts-migration&#34;]
* Update
  * azurerm_virtual_network.migration
  * module.darts_key_vault.azurerm_monitor_diagnostic_setting.kv-ds
  * module.darts_migration_key_vault.azurerm_key_vault.kv
  * module.darts_migration_key_vault.azurerm_monitor_diagnostic_setting.kv-ds
  * module.sa-migration.azurerm_storage_account.storage_account
* Replace
  * module.darts_migration_key_vault.azurerm_key_vault_access_policy.creator_access_policy
  * module.darts_migration_key_vault.azurerm_key_vault_access_policy.developer[0]
  * module.darts_migration_key_vault.azurerm_key_vault_access_policy.managed_identity_access_policy[&#34;b31f6666-e2e4-4a0b-9399-b64446b1e412&#34;]
  * module.darts_migration_key_vault.azurerm_key_vault_access_policy.product_team_access_policy


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.palo_password will be created
  + resource "azurerm_key_vault_secret" "palo_password" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/darts-migration-stg-rg/providers/Microsoft.KeyVault/vaults/darts-migration-stg"
      + name                    = "darts-migration-palo-vm01-stg"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_linux_virtual_machine.palo will be created
  + resource "azurerm_linux_virtual_machine" "palo" {
      + admin_password                  = (sensitive value)
      + admin_username                  = "dartsadmin"
      + allow_extension_operations      = true
      + computer_name                   = (known after apply)
      + disable_password_authentication = true
      + extensions_time_budget          = "PT1H30M"
      + id                              = (known after apply)
      + location                        = "uksouth"
      + max_bid_price                   = -1
      + name                            = "darts-migration-palo-vm01-stg"
      + network_interface_ids           = (known after apply)
      + patch_assessment_mode           = "ImageDefault"
      + patch_mode                      = "ImageDefault"
      + platform_fault_domain           = -1
      + priority                        = "Regular"
      + private_ip_address              = (known after apply)
      + private_ip_addresses            = (known after apply)
      + provision_vm_agent              = true
      + public_ip_address               = (known after apply)
      + public_ip_addresses             = (known after apply)
      + resource_group_name             = "darts-migration-stg-rg"
      + size                            = "Standard_D4ds_v5"
      + tags                            = {
          + "application"         = "darts"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/darts-shared-infrastructure.git"
          + "businessArea"        = "Cross-Cutting"
          + "contactSlackChannel" = "#darts-devs"
          + "environment"         = "staging"
          + "managedBy"           = "Darts Modernisation"
        }
      + virtual_machine_id              = (known after apply)

      + os_disk {
          + caching                   = "ReadWrite"
          + disk_size_gb              = (known after apply)
          + name                      = (known after apply)
          + storage_account_type      = "Standard_LRS"
          + write_accelerator_enabled = false
        }

      + source_image_reference {
          + offer     = "vmseries-flex"
          + publisher = "paloaltonetworks"
          + sku       = "bundle2"
          + version   = "latest"
        }
    }

  # azurerm_network_interface.palo["mgmt"] will be created
  + resource "azurerm_network_interface" "palo" {
      + applied_dns_servers           = (known after apply)
      + dns_servers                   = (known after apply)
      + enable_accelerated_networking = false
      + enable_ip_forwarding          = false
      + id                            = (known after apply)
      + internal_dns_name_label       = (known after apply)
      + internal_domain_name_suffix   = (known after apply)
      + location                      = "uksouth"
      + mac_address                   = (known after apply)
      + name                          = "darts-migration-palo-vm01-mgmt-nic-stg"
      + private_ip_address            = (known after apply)
      + private_ip_addresses          = (known after apply)
      + resource_group_name           = "darts-migration-stg-rg"
      + tags                          = {
          + "application"         = "darts"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/darts-shared-infrastructure.git"
          + "businessArea"        = "Cross-Cutting"
          + "contactSlackChannel" = "#darts-devs"
          + "environment"         = "staging"
          + "managedBy"           = "Darts Modernisation"
        }
      + virtual_machine_id            = (known after apply)

      + ip_configuration {
          + gateway_load_balancer_frontend_ip_configuration_id = (known after apply)
          + name                                               = "darts-migration-palo-vm01-mgmt-nic-stg"
          + primary                                            = (known after apply)
          + private_ip_address                                 = (known after apply)
          + private_ip_address_allocation                      = "Dynamic"
          + private_ip_address_version                         = "IPv4"
          + public_ip_address_id                               = (known after apply)
          + subnet_id                                          = (known after apply)
        }
    }

  # azurerm_network_interface.palo["trust"] will be created
  + resource "azurerm_network_interface" "palo" {
      + applied_dns_servers           = (known after apply)
      + dns_servers                   = (known after apply)
      + enable_accelerated_networking = false
      + enable_ip_forwarding          = false
      + id                            = (known after apply)
      + internal_dns_name_label       = (known after apply)
      + internal_domain_name_suffix   = (known after apply)
      + location                      = "uksouth"
      + mac_address                   = (known after apply)
      + name                          = "darts-migration-palo-vm01-trust-nic-stg"
      + private_ip_address            = (known after apply)
      + private_ip_addresses          = (known after apply)
      + resource_group_name           = "darts-migration-stg-rg"
      + tags                          = {
          + "application"         = "darts"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/darts-shared-infrastructure.git"
          + "businessArea"        = "Cross-Cutting"
          + "contactSlackChannel" = "#darts-devs"
          + "environment"         = "staging"
          + "managedBy"           = "Darts Modernisation"
        }
      + virtual_machine_id            = (known after apply)

      + ip_configuration {
          + gateway_load_balancer_frontend_ip_configuration_id = (known after apply)
          + name                                               = "darts-migration-palo-vm01-trust-nic-stg"
          + primary                                            = (known after apply)
          + private_ip_address                                 = (known after apply)
          + private_ip_address_allocation                      = "Dynamic"
          + private_ip_address_version                         = "IPv4"
          + subnet_id                                          = (known after apply)
        }
    }

  # azurerm_network_interface.palo["untrust"] will be created
  + resource "azurerm_network_interface" "palo" {
      + applied_dns_servers           = (known after apply)
      + dns_servers                   = (known after apply)
      + enable_accelerated_networking = false
      + enable_ip_forwarding          = false
      + id                            = (known after apply)
      + internal_dns_name_label       = (known after apply)
      + internal_domain_name_suffix   = (known after apply)
      + location                      = "uksouth"
      + mac_address                   = (known after apply)
      + name                          = "darts-migration-palo-vm01-untrust-nic-stg"
      + private_ip_address            = (known after apply)
      + private_ip_addresses          = (known after apply)
      + resource_group_name           = "darts-migration-stg-rg"
      + tags                          = {
          + "application"         = "darts"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/darts-shared-infrastructure.git"
          + "businessArea"        = "Cross-Cutting"
          + "contactSlackChannel" = "#darts-devs"
          + "environment"         = "staging"
          + "managedBy"           = "Darts Modernisation"
        }
      + virtual_machine_id            = (known after apply)

      + ip_configuration {
          + gateway_load_balancer_frontend_ip_configuration_id = (known after apply)
          + name                                               = "darts-migration-palo-vm01-untrust-nic-stg"
          + primary                                            = (known after apply)
          + private_ip_address                                 = (known after apply)
          + private_ip_address_allocation                      = "Dynamic"
          + private_ip_address_version                         = "IPv4"
          + subnet_id                                          = (known after apply)
        }
    }

  # azurerm_network_security_group.palo_nsg["mgmt"] will be created
  + resource "azurerm_network_security_group" "palo_nsg" {
      + id                  = (known after apply)
      + location            = "uksouth"
      + name                = "darts-migration-palo-mgmt-nsg-stg"
      + resource_group_name = "darts-migration-stg-rg"
      + security_rule       = (known after apply)
      + tags                = {
          + "application"         = "darts"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/darts-shared-infrastructure.git"
          + "businessArea"        = "Cross-Cutting"
          + "contactSlackChannel" = "#darts-devs"
          + "environment"         = "staging"
          + "managedBy"           = "Darts Modernisation"
        }
    }

  # azurerm_network_security_group.palo_nsg["trust"] will be created
  + resource "azurerm_network_security_group" "palo_nsg" {
      + id                  = (known after apply)
      + location            = "uksouth"
      + name                = "darts-migration-palo-trust-nsg-stg"
      + resource_group_name = "darts-migration-stg-rg"
      + security_rule       = (known after apply)
      + tags                = {
          + "application"         = "darts"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/darts-shared-infrastructure.git"
          + "businessArea"        = "Cross-Cutting"
          + "contactSlackChannel" = "#darts-devs"
          + "environment"         = "staging"
          + "managedBy"           = "Darts Modernisation"
        }
    }

  # azurerm_network_security_group.palo_nsg["untrust"] will be created
  + resource "azurerm_network_security_group" "palo_nsg" {
      + id                  = (known after apply)
      + location            = "uksouth"
      + name                = "darts-migration-palo-untrust-nsg-stg"
      + resource_group_name = "darts-migration-stg-rg"
      + security_rule       = (known after apply)
      + tags                = {
          + "application"         = "darts"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/darts-shared-infrastructure.git"
          + "businessArea"        = "Cross-Cutting"
          + "contactSlackChannel" = "#darts-devs"
          + "environment"         = "staging"
          + "managedBy"           = "Darts Modernisation"
        }
    }

  # azurerm_network_security_rule.deny_inbound["mgmt"] will be created
  + resource "azurerm_network_security_rule" "deny_inbound" {
      + access                      = "Deny"
      + description                 = "Default DenyInbound rule"
      + destination_address_prefix  = "*"
      + destination_port_range      = "*"
      + direction                   = "Inbound"
      + id                          = (known after apply)
      + name                        = "DenyAllInbound"
      + network_security_group_name = "darts-migration-palo-mgmt-nsg-stg"
      + priority                    = 4096
      + protocol                    = "*"
      + resource_group_name         = "darts-migration-stg-rg"
      + source_address_prefix       = "*"
      + source_port_range           = "*"
    }

  # azurerm_public_ip.palo_pip["mgmt"] will be created
  + resource "azurerm_public_ip" "palo_pip" {
      + allocation_method       = "Static"
      + ddos_protection_mode    = "VirtualNetworkInherited"
      + fqdn                    = (known after apply)
      + id                      = (known after apply)
      + idle_timeout_in_minutes = 4
      + ip_address              = (known after apply)
      + ip_version              = "IPv4"
      + location                = "uksouth"
      + name                    = "darts-palo-pip-mgmt-stg"
      + resource_group_name     = "darts-migration-stg-rg"
      + sku                     = "Standard"
      + sku_tier                = "Regional"
      + tags                    = {
          + "application"         = "darts"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/darts-shared-infrastructure.git"
          + "businessArea"        = "Cross-Cutting"
          + "contactSlackChannel" = "#darts-devs"
          + "environment"         = "staging"
          + "managedBy"           = "Darts Modernisation"
        }
    }

  # azurerm_storage_blob.migration-st will be created
  + resource "azurerm_storage_blob" "migration-st" {
      + access_tier            = (known after apply)
      + content_type           = "application/octet-stream"
      + id                     = (known after apply)
      + metadata               = (known after apply)
      + name                   = "darts-migration-blob-st-stg"
      + parallelism            = 8
      + size                   = 0
      + storage_account_name   = "sastgdartsmig01"
      + storage_container_name = "darts-migration"
      + type                   = "Block"
      + url                    = (known after apply)
    }

  # azurerm_subnet.palo_subnet["mgmt"] will be created
  + resource "azurerm_subnet" "palo_subnet" {
      + address_prefixes                               = [
          + "10.24.239.112/28",
        ]
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "darts-migration-palo-mgmt-stg"
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = "darts-migration-stg-rg"
      + virtual_network_name                           = "migration-vnet"
    }

  # azurerm_subnet.palo_subnet["trust"] will be created
  + resource "azurerm_subnet" "palo_subnet" {
      + address_prefixes                               = [
          + "10.24.239.80/28",
        ]
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "darts-migration-palo-trust-stg"
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = "darts-migration-stg-rg"
      + virtual_network_name                           = "migration-vnet"
    }

  # azurerm_subnet.palo_subnet["untrust"] will be created
  + resource "azurerm_subnet" "palo_subnet" {
      + address_prefixes                               = [
          + "10.24.239.96/28",
        ]
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "darts-migration-palo-untrust-stg"
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = "darts-migration-stg-rg"
      + virtual_network_name                           = "migration-vnet"
    }

  # azurerm_subnet_network_security_group_association.name["mgmt"] will be created
  + resource "azurerm_subnet_network_security_group_association" "name" {
      + id                        = (known after apply)
      + network_security_group_id = (known after apply)
      + subnet_id                 = (known after apply)
    }

  # azurerm_subnet_network_security_group_association.name["trust"] will be created
  + resource "azurerm_subnet_network_security_group_association" "name" {
      + id                        = (known after apply)
      + network_security_group_id = (known after apply)
      + subnet_id                 = (known after apply)
    }

  # azurerm_subnet_network_security_group_association.name["untrust"] will be created
  + resource "azurerm_subnet_network_security_group_association" "name" {
      + id                        = (known after apply)
      + network_security_group_id = (known after apply)
      + subnet_id                 = (known after apply)
    }

  # azurerm_virtual_network.migration will be updated in-place
  ~ resource "azurerm_virtual_network" "migration" {
      ~ address_space           = [
            # (1 unchanged element hidden)
            "10.24.239.192/26",
          + "10.24.239.112/28",
          + "10.24.239.80/28",
          + "10.24.239.96/28",
        ]
        id                      = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/darts-migration-stg-rg/providers/Microsoft.Network/virtualNetworks/migration-vnet"
        name                    = "migration-vnet"
        tags                    = {
            "application"         = "darts"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/darts-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#darts-devs"
            "environment"         = "staging"
            "managedBy"           = "Darts Modernisation"
        }
        # (6 unchanged attributes hidden)
    }

  # random_password.palo_password will be created
  + resource "random_password" "palo_password" {
      + bcrypt_hash      = (sensitive value)
      + id               = (known after apply)
      + length           = 16
      + lower            = true
      + min_lower        = 1
      + min_numeric      = 1
      + min_special      = 1
      + min_upper        = 1
      + number           = true
      + numeric          = true
      + override_special = "!#$%&*()-_=+[]{}<>:?"
      + result           = (sensitive value)
      + special          = true
      + upper            = true
    }

  # module.darts_key_vault.azurerm_monitor_diagnostic_setting.kv-ds will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
        id                             = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/darts-stg-rg/providers/Microsoft.KeyVault/vaults/darts-stg|darts-stg"
        name                           = "darts-stg"
        # (3 unchanged attributes hidden)

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.darts_migration_key_vault.data.azuread_group.developers will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azuread_group" "developers" {
      + assignable_to_role             = (known after apply)
      + auto_subscribe_new_members     = (known after apply)
      + behaviors                      = (known after apply)
      + description                    = (known after apply)
      + display_name                   = "DTS CFT Developers"
      + dynamic_membership             = (known after apply)
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_enabled                   = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_group_type          = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + provisioning_options           = (known after apply)
      + proxy_addresses                = (known after apply)
      + security_enabled               = (known after apply)
      + theme                          = (known after apply)
      + types                          = (known after apply)
      + visibility                     = (known after apply)
      + writeback_enabled              = (known after apply)
    }

  # module.darts_migration_key_vault.data.azuread_group.product_team[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azuread_group" "product_team" {
      + assignable_to_role             = (known after apply)
      + auto_subscribe_new_members     = (known after apply)
      + behaviors                      = (known after apply)
      + description                    = (known after apply)
      + display_name                   = "DTS Darts Modernisation"
      + dynamic_membership             = (known after apply)
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_enabled                   = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_group_type          = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + provisioning_options           = (known after apply)
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + theme                          = (known after apply)
      + types                          = (known after apply)
      + visibility                     = (known after apply)
      + writeback_enabled              = (known after apply)
    }

  # module.darts_migration_key_vault.data.azurerm_client_config.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_client_config" "current" {
      + client_id       = (known after apply)
      + id              = (known after apply)
      + object_id       = (known after apply)
      + subscription_id = (known after apply)
      + tenant_id       = (known after apply)
    }

  # module.darts_migration_key_vault.azurerm_key_vault.kv will be updated in-place
  ~ resource "azurerm_key_vault" "kv" {
        id                              = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/darts-migration-stg-rg/providers/Microsoft.KeyVault/vaults/darts-migration-stg"
        name                            = "darts-migration-stg"
        tags                            = {
            "application"         = "darts"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/darts-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#darts-devs"
            "environment"         = "staging"
            "managedBy"           = "Darts Modernisation"
        }
      ~ tenant_id                       = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> (known after apply)
        # (12 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.darts_migration_key_vault.azurerm_key_vault_access_policy.creator_access_policy must be replaced
-/+ resource "azurerm_key_vault_access_policy" "creator_access_policy" {
      ~ id                      = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/darts-migration-stg-rg/providers/Microsoft.KeyVault/vaults/darts-migration-stg/objectId/7ef3b6ce-3974-41ab-8512-c3ef4bb8ae01" -> (known after apply)
      - storage_permissions     = [] -> null
      ~ tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" # forces replacement -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.darts_migration_key_vault.azurerm_key_vault_access_policy.developer[0] must be replaced
-/+ resource "azurerm_key_vault_access_policy" "developer" {
      ~ id                      = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/darts-migration-stg-rg/providers/Microsoft.KeyVault/vaults/darts-migration-stg/objectId/b2a1773c-a5ae-48b5-b5fa-95b0e05eee05" -> (known after apply)
      ~ object_id               = "b2a1773c-a5ae-48b5-b5fa-95b0e05eee05" # forces replacement -> (known after apply)
      - storage_permissions     = [] -> null
      ~ tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" # forces replacement -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.darts_migration_key_vault.azurerm_key_vault_access_policy.managed_identity_access_policy["b31f6666-e2e4-4a0b-9399-b64446b1e412"] must be replaced
-/+ resource "azurerm_key_vault_access_policy" "managed_identity_access_policy" {
      ~ id                      = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/darts-migration-stg-rg/providers/Microsoft.KeyVault/vaults/darts-migration-stg/objectId/b31f6666-e2e4-4a0b-9399-b64446b1e412" -> (known after apply)
      - storage_permissions     = [] -> null
      ~ tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" # forces replacement -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.darts_migration_key_vault.azurerm_key_vault_access_policy.product_team_access_policy must be replaced
-/+ resource "azurerm_key_vault_access_policy" "product_team_access_policy" {
      ~ id                      = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/darts-migration-stg-rg/providers/Microsoft.KeyVault/vaults/darts-migration-stg/objectId/87c8cf3d-ff9d-4d8f-8430-ccc737764435" -> (known after apply)
      ~ object_id               = "87c8cf3d-ff9d-4d8f-8430-ccc737764435" # forces replacement -> (known after apply)
      - storage_permissions     = [] -> null
      ~ tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" # forces replacement -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.darts_migration_key_vault.azurerm_monitor_diagnostic_setting.kv-ds will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
        id                             = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/darts-migration-stg-rg/providers/Microsoft.KeyVault/vaults/darts-migration-stg|darts-migration-stg"
        name                           = "darts-migration-stg"
        # (3 unchanged attributes hidden)

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.sa-migration.azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
      + access_tier                       = "Hot"
        id                                = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/darts-migration-stg-rg/providers/Microsoft.Storage/storageAccounts/sastgdartsmig01"
        name                              = "sastgdartsmig01"
        tags                              = {
            "application"         = "darts"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/darts-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#darts-devs"
            "environment"         = "staging"
            "managedBy"           = "Darts Modernisation"
        }
        # (30 unchanged attributes hidden)

      ~ network_rules {
            # (4 unchanged attributes hidden)

          - private_link_access {
              - endpoint_resource_id = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/providers/Microsoft.Security/datascanners/storageDataScanner" -> null
              - endpoint_tenant_id   = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> null
            }
        }

        # (1 unchanged block hidden)
    }

  # module.sa-migration.azurerm_storage_container.container["darts-migration"] will be created
  + resource "azurerm_storage_container" "container" {
      + container_access_type   = "private"
      + has_immutability_policy = (known after apply)
      + has_legal_hold          = (known after apply)
      + id                      = (known after apply)
      + metadata                = (known after apply)
      + name                    = "darts-migration"
      + resource_manager_id     = (known after apply)
      + storage_account_name    = "sastgdartsmig01"
    }

Plan: 23 to add, 5 to change, 4 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":107,"Program":"tfcmt","SHA1":"","Vars":{}} -->